# convert the data into numerical form.

In [2]:
import numpy as np 
import pandas as pd

In [17]:
cricketers = {
    'name':['virat','rohit','shohib'],
    'Age':[31,32,33],
    'Grade':['best','better','good'],
    'Role':['Batsman','Batsman','baller'],
    'Rating':[870,875,770],
    'country':['India','India','pak']
    
}

In [18]:
cricketers['name']
type(cricketers)

dict

In [19]:
cricketers = pd.DataFrame(cricketers)

In [20]:
cricketers

     name  Age   Grade     Role  Rating country
0   virat   31    best  Batsman     870   India
1   rohit   32  better  Batsman     875   India
2  shohib   33    good   baller     770     pak

In [21]:
type(cricketers)

pandas.core.frame.DataFrame

In [22]:
datamapping = {
    "best":3,
    "better":2,
    "good":1
}

In [23]:
datamapping

{'best': 3, 'better': 2, 'good': 1}

In [24]:
cricketers['GradeNew']= cricketers['Grade'].map(datamapping)

In [26]:
import seaborn as sns

In [27]:
cricketers

     name  Age   Grade     Role  Rating country  GradeNew
0   virat   31    best  Batsman     870   India         3
1   rohit   32  better  Batsman     875   India         2
2  shohib   33    good   baller     770     pak         1

In [28]:
data = pd.get_dummies(cricketers['Grade'])

In [29]:
data

   best  better  good
0     1       0     0
1     0       1     0
2     0       0     1

In [30]:
from sklearn.preprocessing import LabelEncoder

In [31]:
le = LabelEncoder()

In [32]:
label = le.fit_transform(cricketers["Grade"])

In [33]:
le.classes_

array(['best', 'better', 'good'], dtype=object)

In [39]:
Data = cricketers.drop("Grade", axis =1)   ##we're dropping this column

In [40]:
Data

     name  Age     Role  Rating country  GradeNew
0   virat   31  Batsman     870   India         3
1   rohit   32  Batsman     875   India         2
2  shohib   33   baller     770     pak         1

In [42]:
Data["Grade"] = label

In [43]:
Data

     name  Age     Role  Rating country  GradeNew  Grade
0   virat   31  Batsman     870   India         3      0
1   rohit   32  Batsman     875   India         2      1
2  shohib   33   baller     770     pak         1      2